[
    {
        "id" : 10,
        "title" : "i18n support",
        "description" : "The application has a built-in i18n support.",
        "created" : "2024-??-??"
    }, {
        "id" : 9,
        "title" : "Job execution UI",
        "description" : "Administrators can check all background job executions on a new UI.",
        "created" : "2024-??-??"
    }, {
        "id" : 8,
        "title" : "Enhanced messages page",
        "description" : "Messages now can be marked as read/unread and can be deleted as well",
        "created" : "2024-08-16"
    }, {
        "id" : 7,
        "title" : "Basic GDPR user deletion(RTBF) feature",
        "description" : "Basic level features for GDPR RTBF has been implemented, so GDPR maintenance systems/DPO can request to delete the given user(s) data from Give My Secret via REST API",
        "created" : "2024-04-11"
    }, {
        "id" : 6,
        "title" : "Basic Keycloak SSO feature",
        "description" : "Basic level features for Keycloak SSO has been implemented, so users can log in with their Keycloak realm users. Currently the only limitation is the lack of 2FA functionality. This will be implemented in the future.",
        "created" : "2024-04-05"
    }, {
        "id" : 5,
        "title" : "IP restriction feature",
        "description" : "Global and secret level IP address restriction feature has been added to Give My Secret to limit the API consumers by their IP addresses.",
        "created" : "2024-03-19"
    }, {
        "id" : 4,
        "title" : "Improvements in LDAP mode",
        "description" : "Major improvements and bugfixes done in the LDAP mode to remove any concerns. However, currently user edition in LDAP mode is not supported.",
        "created" : "2024-03-12"
    }, {
        "id" : 3,
        "title" : "Password reset feature",
        "description" : "From this version blocked/disabled users can request password reset from administrators.",
        "created" : "2024-02-05"
    }, {
        "id" : 2,
        "title" : "User block feature",
        "description" : "Users can be blocked after X failed attempts if they cannot provide their credentials properly. Only administrators can unblock them. There is a task in the GMS backlog on GitHub to implement a feature to let the users request unlock their account.",
        "created" : "2024-01-29"
    }, {
        "id" : 1,
        "title" : "What's new in January 2024",
        "description" : "The development of the Give My Secret continues in 2024! The first new feature is this system announcement board where you can check the recent changes of the application in the future.",
        "created" : "2024-01-25"
    }
] 
